{
    "Top Of The Hill Restaurant & Brewery":
    {
        "PORTHOLE ROLLS":[{
            "Description":"Pull-apart soft yeast rolls baked with an herbed parmesan crust",
            "Price":4.50    
        }]
        ,
        "JALAPEÑO-CHEDDAR HUSHPUPPIES":[{
            "Description":"half dozen organic cornmeal hushpuppies blended with minced jalapeño, cheddar cheese & local buttermilk served with white cocktail sauce for dipping (vegetarian)",
            "Price":6.99    
        }
        ],
        "LIZARD CHIPS":[{
            "Description":"sliced dill pickle & jalapeño chips crispy-fried in TOPO beer batter, served with chipotle ranch dipping sauce (vegetarian)",
            "Price": 9.50 
        }
        ],
        "THUMBS & TOES":[{
            "Description":"half-pound of juicy fried chicken tenders tossed in your choice of buffalo, BBQ, Thai chili or garlic Sriracha sauce",
            "Price": 10.99 
        }
        ],
        "BAVARIAN PRETZELS":[{
            "Description":"served with TOPO beer cheese sauce (vegetarian)",
            "Price": 8.99
        }
        ],
        "FRANKLIN STREET NACHOS":[{
            "Description":"crisp tortilla chips topped with cheddar cheese, black beans, pico de gallo & sour cream (vegetarian)",
            "Price":  10.50
        }
        ],
        "SWEET POTATOES & PEPPADEW PEPPER JELLY":[{
            "Description":"waffle-cut sweet potato fries with cream cheese & house-made pepper jelly dip (vegetarian) (gluten free)",
            "Price": 11.99
        }
        ],
        "MEDITERRANEAN HUMMUS DIP":[{
            "Description":"creamy house-made hummus filled with artichoke, sun dried tomatoes, Kalamata Olives, scallions & pita chips for dipping",
            "Price": 11.99
        }
        ],
        "HOUSE SALAD":[{
            "Description":"fresh greens, gorgonzola cheese, tomatoes, cucumbers & your choice of dressing: Old Well White vinaigrette, raspberry vinaigrette, honey dijon, blue cheese, ranch, baja or oil & vinegar (vegetarian)",
            "Price": 8.25
        }
        ],
        "GOAT CHEESE SALAD":[{
            "Description":"fresh greens tossed in house-made raspberry vinaigrette, garnished with pecans, golden raisins & local goat cheese (vegetarian)",
            "Price": 10.50 
        }
        ],
        "BAJA CHICKEN SALAD":[{
            "Description":"fresh greens tossed in a house-made creamy Baja dressing, tomatoes, cucumbers, hard boiled eggs, gorgonzola, white & yellow cheddar cheese topped with cornmeal encrusted chicken skewers & Baja tortilla crisps",
            "Price": 13.99
        }
        ],
        "THAI SEARED TUNA* SALAD":[{
            "Description":"sliced sushi grade tuna*, seared rare with Thai chili sauce, wasabi cream, frizzled onions, honey roasted nuts & sesame seeds, atop a bed of fresh greens",
            "Price": 15.25
        }
        ],
        "SALMON SALAD":[{
            "Description":"grilled 8 oz. salmon on your choice of salad: house, goat cheese, Baja or Thai",
            "Price": 18.99
        }
        ],
        "TUSCAN DELI CLUB":[{
            "Description":"ham, turkey & smoked provolone on rustic Italian bread with shredded lettuce, tomato, red onions, banana peppers, red wine vinaigrette, chipotle aioli, served with Old Bay kettle chips",
            "Price": 13.25 
        }
        ],
        "SOUTHERN FRIED CHICKEN SANDWICH":[{
            "Description":"local Chatham County Farms fried chicken breast with dill pickles & aioli on a house-made brioche bun, served with beer battered fries",
            "Price": 13.25  
        }
        ],
        "TOP BURGER*":[{
            "Description":"grilled 8 oz. beef burger* with lettuce, tomato, red onion, aioli & your choice of American cheese, pepper jack, cheddar, Swiss or gorgonzola on a house-made brioche bun, served with beer-battered fries",
            "Price":13.99
        }
        ],
        "EDAMAME BURGER":[{
            "Description":"house-made edamame patty with tzatziki, lettuce, tomato, & red onion on a house-made brioche bun with sweet potato waffle fries (vegetarian)",
            "Price": 14.50 
        }
        ],
        "WILD MUSHROOM GRIT CAKES":[{
            "Description":"crisp local & organic grit cakes with sautéed portobello, shiitake & oyster mushrooms in a rosemary-cashew cream sauce (vegetarian)",
            "Price": 13.99
        }
        ],
        "LOW COUNTRY PORK CHOP":[{
            "Description":"grilled 12 oz. bone in pork chop with creole dijon cream sauce, herb roasted potatoes, southern cabbage and kale",
            "Price": 22.99
        }
        ],
        "BUTTERMILK FRIED CHICKEN":[{
            "Description":"locally sourced chicken breast, crispy fried with mushroom cream gravy topped with diced tomatoes & scallions, mashed potatoes, seasonal vegetables & a buttermilk biscuit",
            "Price": 18.50
        }
        ],
        "SOUTHWEST CHICKEN PASTA":[{
            "Description":"gemelli pasta tossed with grilled chicken, black beans, shoe-peg corn and chipotle cream sauce, topped with scallions, tomatoes & white cheddar cheese and crisp tortilla strips",
            "Price": 16.99
        }
        ],
        "FRENCH QUARTER JAMBALAYA":[{
            "Description":"shrimp, grilled chicken & Andouille sausage sautéed with arborio rice, onions, tomatoes & roasted okra in a rich Cajun broth",
            "Price": 17.50 
        }
        ],
        "JAMAICAN JERK SALMON":[{
            "Description":"pan seared 8oz salmon with mango pico de gallo, tequila-lime butter sauce, spinach & tomato brown rice",
            "Price": 23.99
        }
        ],
        "TOPO WHISKEY & COKE BRAISED BEEF":[{
            "Description":"boneless beef short rib slow-braised in a whikey & Coke sauce with roasted vegetables & mashed potatoes.",
            "Price": 23.99
        }
        ],
        "NEW YORK STRIP STEAK*":[{
            "Description":"salt & pepper grilled hand-cut 12 oz. NY strip steak* topped with house made Worcestershire sauce, mashed potatoes & garlic sautee' spinach",
            "Price": 29.99
        }
        ],
        "MEXICALI BOWL":[{
            "Description":"brown rice, black beans, mixed cheddar cheeses, pico de gallo, avocado, pickled jalapeños, sour cream & crisp tortilla strips",
            "Price": 12.50 
        }
        ],
        "QUINOA BOWL":[{
            "Description":"black, red & golden quinoa with baby greens, Old Well White vinaigrette, grape tomatoes, red onions, cucumber & house-made feta tzatziki",
            "Price": 12.99
        }
        ],
        "TERIYAKI CAULIFLOWER BOWL":[{
            "Description":"brown rice stir-fried with cauliflower, edamame, red & green cabbage, red & poblano peppers, scallions & sesame seeds in a sesame-soy sauce",
            "Price": 12.99
        }
        ],
        "CREME BRÛLÉE CHEESECAKE":[{
            "Description":"vanilla cheesecake with torched sugar crust, raspberry sauce & Chantilly cream",
            "Price": 8.99 
        }
        ],
        "TAR HEEL BUNDT CAKE":[{
            "Description":"Rich triple chocolate mini bundt cake with vanilla ice cream & chocolate sauce",
            "Price": 8.99
        }
        ],
        "KEY LIME POT DE CREME":[{
            "Description":"Rich key lime custard with cinnamon graham crumble topped with raspberry sauce, Chantilly cream & candied lime",
            "Price": 7.99
        }
        ],
        "RED VELVET ICE CREAM CAKE":[{
            "Description":"Red velvet cake with cream cheese ice cream topped with topped with chocolate sauce and whipped cream",
            "Price": 7.99 
        }
        ]
    }
    ,
    "Sup Dogs": 
    {
        "Cheesy Tots":[{
            "Description":"Our famous Sup tots covered in shredded cheese and melted all over.",
            "Price": 8.99
        }
        ], 
        "Jalapeno Popper Tots":[{
            "Description":"A pile of Sup tots topped with shredded cheese, fresh diced jalapeños and drizzled with hot sauce and ranch.",
            "Price": 8.99
        }
        ],
        "Macho Nachos":[{
            "Description":"Fresh warm chips smothered in homemade chili and melted cheeses, topped with lettuce, fresh cut jalapeños and sour cream.",
            "Price": 8.99
        }
        ],
        "Buffalo Boneless Wings":[{
            "Description":"1/2 pound of smothered deliciousness, choose from Buffalo, honey BBQ or smoky BBQ style.",
            "Price": 8.99 
        }
        ],"Pepperoni Pizza Fries":[{
            "Description":"Our thick, long-cut fries topped with melted Mozzarella cheese, bold pizza sauce and flavorful pepperoni slices. Served with homemade ranch for dipping.",
            "Price": 8.99
        }
        ],"Taco Tots":[{
            "Description":"Our Sup tots topped with chili, mixed cheeses, lettuce, tomatoes and drizzled with hot sauce.",
            "Price": 8.99
        }
        ],"Green Bean Fries":[{
            "Description":"A pile of lightly battered green beans, flash-fried and served with homemade ranch for dipping.",
            "Price": 8.99
        }
        ],"Fried Pickle Fries":[{
            "Description":"Crispy, tangy thin-cut dill pickle fries. Served with homemade ranch for dipping.",
            "Price": 8.99
        }
        ],"Funnel Cake Stix":[{
            "Description":"One bite will take you back to the North Carolina state fair. Sprinkled with powdered sugar and perfect for sharing.",
            "Price": 8.99
        }
        ],"Sup Dog Combo":[{
            "Description":"Our pride and joy. A homemade 16 ingredient chili simmered for over 6 hours, sitting on top of an all-beef hot dog and topped with our special Sup Dog sauce. All combos include a pile of long-cut fries and famous Sup Dog sauce for dipping.",
            "Price": 7.99
        }
        ],"Old School Dog Combo":[{
            "Description":"Done in the memory of the old school chili dog. An all-beef hot dog topped with fresh cut onions, homemade chili and mustard. Be young again! All combos include a pile of long-cut fries and famous Sup Dog sauce for dipping.",
            "Price": 7.99
        }
        ],"Simple Dog Combo":[{
            "Description":"A plain all-beef dog, sitting on a warm, steamy bun. All combos include a pile of long-cut fries and famous Sup Dog sauce for dipping.",
            "Price": 7.99 
        }
        ],"Slaw Dog Combo":[{
            "Description":"Our homemade chili and delicious slaw come together to meet between the buns. All combos include a pile of long-cut fries and famous Sup Dog sauce for dipping.",
            "Price": 7.99 
        }
        ],
        "Spicy Dog Combo":[{
            "Description":"This is a BIG, thiccc, spicy, all-beef hot dog. Tell us how you want it! *Double The Dog $2 All combos include a pile of long-cut fries and famous Sup Dog sauce for dipping.",
            "Price": 7.99
        }
        ],"Chili Cheese Dog Combo":[{
            "Description":"Shredded Monterey Jack and Cheddar cheeses, slightly melted underneath our homemade chili. All combos include a pile of long-cut fries and famous Sup Dog sauce for dipping.",
            "Price": 7.99
        }
        ],"Smokehouse Dog Combo":[{
            "Description":"Bacon, Monterey Jack and Cheddar cheese, chili, Sup Dog sauce. All combos include a pile of long-cut fries and famous Sup Dog sauce for dipping",
            "Price": 7.99
        }
        ],"Hawaiian Dog Combo":[{
            "Description":"Sweet pineapple, honey mustard, Sup Dog sauce. All combos include a pile of long-cut fries and famous Sup Dog sauce for dipping.",
            "Price": 7.99 
        }
        ],"Sweet Dog Combo":[{
            "Description":"Bacon, fresh cut lettuce, honey mustard, Sup Dog sauce. All combos include a pile of long-cut fries and famous Sup Dog sauce for dipping.",
            "Price": 7.99 
        }
        ],"Firehouse Dog Combo":[{
            "Description":"Chili, fresh cut jalapeños, Monterey Jack and Cheddar cheeses, hot sauce. All combos include a pile of long-cut fries and famous Sup Dog sauce for dipping.",
            "Price": 7.99
        }
        ],"Cool Down Dog Combo":[{
            "Description":"Monterey Jack and Cheddar cheeses, chili, lettuce, cool sour cream. All combos include a pile of long-cut fries and famous Sup Dog sauce for dipping.",
            "Price": 7.99 
        }
        ],"Cheesy Bacon Delight Combo":[{
            "Description":"Lots of melty cheese, bacon, Sup Dog sauce. All combos include a pile of long-cut fries and famous Sup Dog sauce for dipping.",
            "Price": 7.99
        }
        ],
        "Smokehouse Burger Combo":[{
            "Description":"A burger that can't get any more juicy and smoky, over 1/3 lb patty topped with thick sliced bacon, grilled onions, cheese and Sup Dog sauce. All combos include a pile of long-cut fries and famous Sup Dog sauce for dipping.",
            "Price": 9.99 
        }
        ],
        "Sup Burger Combo with Cheese":[{
            "Description":"Some people say restaurant style burgers, but we say Sup Dog style burgers! A 1/3 lb. hand-packed fresh burger, topped with American cheese, lettuce, tomato, onions, fresh cut pickles and of course, Sup Dog sauce. All combos include a pile of long-cut fries and famous Sup Dog sauce for dipping.",
            "Price": 9.99
        }
        ],
        "Buffalo Chicken Sandwich Combo":[{
            "Description":"Our lightly battered chicken, dipped in our homemade Buffalo sauce and topped with melted American cheese, homemade ranch, onions, lettuce and tomato. All combos include a pile of long-cut fries and famous Sup Dog sauce for dipping.",
            "Price": 9.99
        }
        ],
        "Hot Honey BBQ Chicken Sandwich Combo":[{
            "Description":"Our mouth-watering chicken, lightly battered and tossed in our homemade honey BBQ sauce. Topped with lettuce, cheese, ranch and sliced hickory bacon. All combos include a pile of long-cut fries and famous Sup Dog sauce for dipping.",
            "Price": 9.99
        }
        ]
    }
    ,
    "McDonald's":
    {
        "Bacon, Egg & Cheese Biscuit":[{
            "Description":"The McDonald's Bacon, Egg & Cheese Biscuit breakfast sandwich features a warm, buttermilk biscuit brushed with real butter, thick cut Applewood smoked bacon, a fluffy folded egg, and a slice of melty American cheese.",
            "Price": 3.99 
        }
        ],
        "Egg McMuffin":[{
            "Description":"McDonald's Egg McMuffin® recipe features a freshly cracked Grade A egg placed on a toasted English Muffin topped with real butter, lean Canadian bacon, and melty American cheese.",
            "Price": 3.99
        }
        ],
        "Sausage McMuffin":[{
            "Description":"McDonald's Sausage McMuffin® recipe features a warm, freshly toasted English muffin, topped with a savory hot sausage patty and a slice of melty American cheese.",
            "Price": 3.99  
        }
        ],
        "Sausage McMuffin® with Egg":[{
            "Description":"McDonald’s Sausage McMuffin® with Egg features a savory hot sausage, a slice of melty American cheese, and a delicious freshly cracked egg all on a freshly toasted English muffin.",
            "Price": 4.99 
        }
        ],
        "Sausage Biscuit":[{
            "Description":"McDonald’s Sausage Biscuit is the perfect sausage breakfast sandwich to start your day! Our Sausage Biscuit recipe is made with sizzling hot sausage on a warm buttermilk biscuit that’s topped with real butter and baked to perfection.",
            "Price": 2.99
        }
        ],
        "Sausage Biscuit with Egg":[{
            "Description":"McDonald's Sausage and Egg Biscuit sandwich features a warm, flaky biscuit brushed with real butter, a sizzling hot pork sausage patty, and a classic McDonald's folded egg. It's the perfect savory biscuit breakfast sandwich when you're looking for a quick, easy breakfast.",
            "Price": 3.99
        }
        ],
        "Bacon, Egg & Cheese McGriddles":[{
            "Description":"Bacon, Egg & Cheese McGriddles® feature soft, warm griddle cakes with the sweet taste of maple. McDonald's McGriddles® recipe features thick-cut Applewood smoked bacon, a fluffy folded egg, and a slice of melty American cheese. McGriddles® cakes have no artificial preservatives or flavors and no colors from artificial sources.",
            "Price": 4.99
        }
        ],
        "Sausage McGriddles":[{
            "Description":"Our Sausage McGriddles® breakfast sandwich features soft, warm griddle cakes—with the taste of sweet maple—that hold our savory, sizzling hot sausage. McGriddles® cakes have no artificial preservatives or flavors and no colors from artificial sources.",
            "Price": 2.99 
        }
        ],
        "Sausage, Egg & Cheese McGriddles":[{
            "Description":"Sausage, Egg & Cheese McGriddles® feature soft, warm griddle cakes—with the sweet taste of maple—that hold a fluffy folded egg, savory sausage, and melty American cheese. McGriddles® cakes have no artificial preservatives or flavors and no colors from artificial sources.",
            "Price": 3.99 
        }
        ],
        "Hotcakes and Sausage":[{
            "Description":"Featuring 3 golden brown hotcakes and real butter, topped with sweet maple flavored hotcake syrup. On the side, you get a hot McDonald's sausage patty.",
            "Price": 6.99
        }
        ],"Hotcakes":[{
            "Description":"This McDonald's breakfast comes with 3 golden brown hotcakes. There are 580 calories in McDonald's hotcakes.",
            "Price": 3.99 
        }
        ],"Sausage Burrito":[{
            "Description":"McDonald's Breakfast Burrito recipe is loaded with fluffy scrambled egg, pork sausage, melty cheese, green chiles, and onion!",
            "Price": 4.99 
        }
        ],"Big Mac":[{
            "Description":"two 100% pure all beef patties and Big Mac® sauce sandwiched between a sesame seed bun. It’s topped off with pickles, crisp shredded lettuce, finely chopped onion, and a slice of American cheese. It contains no artificial flavors, preservatives, or added colors from artificial sources. Our pickle contains an artificial preservative, so skip it if you like.",
            "Price": 3.49
        }
        ],"Quarter Pounder®* with Cheese":[{
            "Description":"Each Quarter Pounder® with Cheese burger features a ¼ lb.* of 100% fresh beef that’s hot, deliciously juicy and cooked when you order. It’s seasoned with just a pinch of salt and pepper, sizzled on a flat iron grill, then topped with slivered onions, tangy pickles and two slices of melty American cheese on a sesame seed bun. Our QPC® contains no artificial flavors, preservatives or added colors from artificial sources.",
            "Price": 4.49
        }
        ],"Double Quarter Pounder®* with Cheese":[{
            "Description":"Each Double Quarter Pounder with Cheese features two quarter pound* 100% fresh beef burger patties that are hot, deliciously juicy and cooked when you order. McDonald’s beef patties are seasoned with just a pinch of salt and pepper, sizzled on a flat iron grill, then topped with slivered onions, tangy pickles and two slices of melty cheese on a sesame seed bun. It contains no artificial flavors, preservatives or added colors from artificial sources.",
            "Price": 5.49  
        }
        ],"Quarter Pounder®* with Cheese Deluxe":[{
            "Description":"McDonald's Quarter Pounder® with Cheese Deluxe is a fresh take on a Quarter Pounder® classic burger. Crisp shredded lettuce and three Roma tomato slices top a ¼ lb.* of 100% McDonald’s fresh beef that’s hot, deliciously juicy and cooked when you order. Seasoned with just a pinch of salt and pepper and sizzled on our flat iron grill. Layered with two slices of melty American cheese, creamy mayo, slivered onions and tangy pickles on a soft, fluffy sesame seed hamburger bun. ",
            "Price": 6.49
        }
        ],"Cheeseburger":[{
            "Description":"Our simple, classic cheeseburger begins with a 100% pure beef burger patty seasoned with just a pinch of salt and pepper. The McDonald’s Cheeseburger is topped with a tangy pickle, chopped onions, ketchup, mustard, and a slice of melty American cheese. It contains no artificial flavors, preservatives or added colors from artificial sources.",
            "Price": 2.99
        }
        ]
    },
    "Bojangles":{
        "GOAT CHEESE SALAD":[{
            "Description":"fresh greens tossed in house-made raspberry vinaigrette, garnished with pecans, golden raisins & local goat cheese (vegetarian)",
            "Price": 10.50 
        }]
    }
}